{
  "personalInfo": {
    "name": "Joel Thompson",
    "phone": "916.337.1795",
    "email": "joelthomps90@gmail.com",
    "website": "byjoelthompson.com"
  },
  "summary": "Software Engineer with 12+ years building scalable web applications. Expertise in React/Next.js development and AI-powered tools. Proven track record of system architecture and delivering reliable production systems.",
  "experience": [
    {
      "company": "CircleCI",
      "title": "Senior Software Engineer",
      "startDate": "September 2020",
      "endDate": "Present",
      "responsibilities": [
        "Architected and implemented AI-powered pipeline assistant chatbot from feasibility analysis through production deployment. Built and open-sourced MCP server for CircleCI, enabling agent-based tools integration for the developer community.",
        "Spearheaded project creation flow overhaul and authentication system modernization across multiple teams. Drove UI component standardization as project lead and accelerate junior developer productivity through weekly 1:1 mentoring.",
        "Maintain high system reliability through monthly on-call rotation and technical decision-making in architecture meetings, sprint facilitation, and strategic planning to improve project delivery predictability."
      ]
    },
    {
      "company": "Intercom",
      "positions": [
        {
          "title": "Product Engineer",
          "startDate": "March 2016",
          "endDate": "September 2020"
        },
        {
          "title": "Product Support Engineer",
          "startDate": "August 2017",
          "endDate": "August 2018"
        },
        {
          "title": "Support Engineer",
          "startDate": "March 2016",
          "endDate": "August 2017"
        }
      ],
      "responsibilities": [
        "Architected and implemented behavioral experimentation framework for marketing site with real-time visitor segmentation. Built comprehensive A/B testing infrastructure for Inbox onboarding flows with feature flag systems and statistical validation.",
        "Coordinated cross-functional pricing model initiative across engineering, marketing, and design teams. Led agile ceremonies and mentored team members as part of engineering leadership rotation."
      ]
    },
    {
      "company": "FileOpen Systems",
      "title": "Software Engineer",
      "startDate": "September 2012",
      "endDate": "February 2016",
      "responsibilities": [
        "Owned build and release pipeline for core SaaS product and established company-wide bug tracking infrastructure. Developed .NET C# applications, managed SQL database operations, and provided post-sales technical support.",
        "Led technical planning and execution to extend marketing site experimentation framework, adding support for running experiments based on visitor behavior patterns."
      ]
    }
  ],
  "skills": {
    "languages": ["Typescript / Javascript", "GoLang", "Ruby", "Python"],
    "frontend": ["NextJS", "React"],
    "backend": ["Express.js", "Gin", "Ruby on Rails"],
    "platformArchitecture": [
      "MCP Server Development",
      "System Architecture",
      "On-call incident response",
      "Vercel",
      "Netlify"
    ],
    "tools": ["Cursor", "Windsurf", "Aider"]
  },
  "education": {
    "institution": "UC Santa Cruz",
    "degree": "B.S. in Computer Engineering"
  }
}
